__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 576, 768, 3)  0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 284, 380, 64) 15616       input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 284, 380, 64) 256         conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 284, 380, 64) 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 140, 188, 64) 0           activation_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 140, 188, 64) 4160        max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 140, 188, 64) 256         conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 140, 188, 64) 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 140, 188, 64) 4160        activation_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 140, 188, 64) 256         conv2d_3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 140, 188, 64) 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 140, 188, 256 16640       activation_3[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 140, 188, 256 65792       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 288, 384, 256 3328        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 140, 188, 256 1024        conv2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 140, 188, 256 1024        conv2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 288, 384, 256 1024        conv2d_6[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 140, 188, 256 0           batch_normalization_4[0][0]
                                                                 batch_normalization_5[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 140, 188, 256 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 140, 188, 256 0           add_1[0][0]
                                                                 max_pooling2d_2[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 140, 188, 256 0           multiply_1[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 140, 188, 64) 16448       activation_4[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 140, 188, 64) 256         conv2d_7[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 140, 188, 64) 0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 140, 188, 64) 4160        activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 140, 188, 64) 256         conv2d_8[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 140, 188, 64) 0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 140, 188, 256 16640       activation_6[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 140, 188, 256 1024        conv2d_9[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 140, 188, 256 0           batch_normalization_9[0][0]
                                                                 activation_4[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 140, 188, 64) 16448       add_2[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 140, 188, 64) 256         conv2d_10[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 140, 188, 64) 0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 140, 188, 64) 4160        activation_7[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 140, 188, 64) 256         conv2d_11[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 140, 188, 64) 0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 140, 188, 256 16640       activation_8[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 140, 188, 256 262400      add_2[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 288, 384, 256 3328        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 140, 188, 256 1024        conv2d_12[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 140, 188, 256 1024        conv2d_13[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 288, 384, 256 1024        conv2d_14[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 140, 188, 256 0           batch_normalization_12[0][0]
                                                                 batch_normalization_13[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 140, 188, 256 0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 140, 188, 256 0           add_3[0][0]
                                                                 max_pooling2d_3[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 140, 188, 256 0           multiply_2[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 140, 188, 64) 16448       activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 140, 188, 64) 256         conv2d_15[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 140, 188, 64) 0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 140, 188, 64) 4160        activation_10[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 140, 188, 64) 256         conv2d_16[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 140, 188, 64) 0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 140, 188, 256 16640       activation_11[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 140, 188, 256 1024        conv2d_17[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 140, 188, 256 0           batch_normalization_17[0][0]
                                                                 activation_9[0][0]
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 139, 187, 256 0           add_4[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 70, 94, 256)  65536       average_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 70, 94, 256)  1024        conv2d_18[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 140, 188, 256 0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 140, 188, 256 0           lambda_1[0][0]
                                                                 add_2[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 140, 188, 64) 16384       add_5[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 140, 188, 64) 256         conv2d_19[0][0]
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 280, 376, 64) 0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 284, 380, 64) 0           lambda_2[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 284, 380, 64) 0           zero_padding2d_1[0][0]
                                                                 activation_1[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 284, 380, 512 32768       add_6[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 284, 380, 512 2048        conv2d_20[0][0]
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 107920, 512)  0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 107920, 512)  0           reshape_1[0][0]
==================================================================================================
Total params: 615,680
Trainable params: 608,768
Non-trainable params: 6,912
__________________________________________________________________________________________________